# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_library_set -name default -timing {../../../../../dkit/FreePDK45/FreePDK45/osu_soc/lib/files/gscl45nm.lib ../../../lib/TSV_lib/TSV.lib ../output_w8_b512_freepdk45/sram_w8_b512_freepdk45_TT_1p0V_25C.lib} 
create_constraint_mode -name default -sdc_files {input_files/top.sdc}
create_delay_corner -name default -library_set {default}
create_analysis_view -name default -constraint_mode {default} -delay_corner {default}
set_analysis_view -setup {default} -hold {default}
