# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_library_set -name typical -timing { ../../../../../dkit/FreePDK45/FreePDK45/osu_soc/lib/files/gscl45nm.lib ../output_w8_b512_freepdk45/sram_w8_b512_freepdk45_TT_1p0V_25C.lib }
create_constraint_mode -name timing_cons -sdc_files {input_files/ram_only.sdc}
create_delay_corner -name default -library_set {typical}
create_analysis_view -name ana_1 -constraint_mode {timing_cons} -delay_corner {default}
set_analysis_view -setup {ana_1} -hold {ana_1}
